In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("e:/dataset/analysis/restaurant.csv")
df

     total_bill   tip  gender smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [4]:
#SERIES
#=============
#df.total_bill
#df[['total_bill']]
s=df['total_bill']
type(s)

pandas.core.series.Series

In [5]:
s.sum()

4827.77

In [6]:
df.total_bill.sum()

4827.77

In [7]:
df.total_bill.mean()

19.78594262295082

In [8]:
df.total_bill.count()

244

In [9]:
df.total_bill.max()

50.81

In [10]:
df.total_bill.min()

3.07

In [11]:
df.total_bill.median()

17.795

In [12]:
df.total_bill.mode()

0    13.42
Name: total_bill, dtype: float64

In [13]:
df.gender.sum()

'FemaleMaleMaleMaleFemaleMaleMaleMaleMaleMaleMaleFemaleMaleMaleFemaleMaleFemaleMaleFemaleMaleMaleFemaleFemaleMaleMaleMaleMaleMaleMaleFemaleMaleMaleFemaleFemaleMaleMaleMaleFemaleMaleMaleMaleMaleMaleMaleMaleMaleMaleMaleMaleMaleMaleFemaleFemaleMaleMaleMaleMaleFemaleMaleMaleMaleMaleMaleMaleMaleMaleFemaleFemaleMaleMaleMaleFemaleFemaleFemaleFemaleMaleMaleMaleMaleMaleMaleMaleFemaleMaleMaleFemaleMaleMaleMaleMaleMaleMaleFemaleFemaleFemaleMaleMaleMaleMaleMaleFemaleFemaleFemaleFemaleFemaleMaleMaleMaleMaleFemaleMaleFemaleMaleMaleFemaleFemaleMaleFemaleFemaleFemaleMaleFemaleMaleMaleFemaleFemaleMaleFemaleFemaleMaleMaleFemaleFemaleFemaleFemaleFemaleFemaleFemaleMaleFemaleFemaleMaleMaleFemaleFemaleFemaleFemaleFemaleMaleMaleMaleMaleMaleMaleMaleFemaleMaleFemaleFemaleMaleMaleMaleFemaleMaleFemaleMaleMaleMaleFemaleFemaleMaleMaleMaleMaleMaleMaleMaleMaleFemaleMaleMaleMaleMaleMaleMaleMaleFemaleMaleFemaleMaleMaleFemaleMaleMaleMaleMaleMaleFemaleFemaleMaleMaleFemaleFemaleFemaleMaleFemaleMaleMaleMaleFemaleMaleMaleMaleFemaleFemaleFemaleMaleMaleMaleFemaleMaleFemaleMaleFemaleMaleFemaleFemaleMaleMaleFemaleMaleMaleMaleMaleMaleMaleMaleMaleFemaleMaleFemaleMaleMaleFemale'

In [14]:
#df.gender.median()       #error
#df.gender.mean()         #error
df.gender.max()

'Male'

In [15]:
df.gender.unique()

array(['Female', 'Male'], dtype=object)

In [16]:
#df.total_bill.unique()

- **string**
- 1. categorical
    - ye ek aisa column hota hai jo fixed hota hai. for example-----sunday,monday-----months name-----gender(male,female,other)
- 2. text------text column me example ke liye sabhi ke ------ **House Address**.

In [17]:
df.time.unique()

array(['Dinner', 'Lunch'], dtype=object)

In [18]:
df.smoker.unique()

array(['No', 'Yes'], dtype=object)

- df.time.**value_count**

In [19]:
#ye unique value value ke sath sath us unique value ke counts bhi sath me kr ke deta hai.
df.time.value_counts()

Dinner    176
Lunch      68
Name: time, dtype: int64

In [20]:
df.day.value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

## Exploratory Data Analysis (EDA)
### **Data ki summary nikalne ke liye**
- **1. Describe method**
- ye integer column pe work krta hai
    - data ki puri summary deta hai
    _ return new df containing summay of existing df

In [21]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

- **describe method** me ydi hume string value pe work krna hai to.
- **summary**(count,mean,std,min,max,25%,50%(median),75%)-----**insight**(unique,top,freq)

In [22]:
df.describe(include='all')

        total_bill         tip gender smoker  day    time        size
count   244.000000  244.000000    244    244  244     244  244.000000
unique         NaN         NaN      2      2    4       2         NaN
top            NaN         NaN   Male     No  Sat  Dinner         NaN
freq           NaN         NaN    157    151   87     176         NaN
mean     19.785943    2.998279    NaN    NaN  NaN     NaN    2.569672
std       8.902412    1.383638    NaN    NaN  NaN     NaN    0.951100
min       3.070000    1.000000    NaN    NaN  NaN     NaN    1.000000
25%      13.347500    2.000000    NaN    NaN  NaN     NaN    2.000000
50%      17.795000    2.900000    NaN    NaN  NaN     NaN    2.000000
75%      24.127500    3.562500    NaN    NaN  NaN     NaN    3.000000
max      50.810000   10.000000    NaN    NaN  NaN     NaN    6.000000

In [23]:
df.describe(include='object')    #ye hume insight data ke bare me batata hai.

       gender smoker  day    time
count     244    244  244     244
unique      2      2    4       2
top      Male     No  Sat  Dinner
freq      157    151   87     176

In [24]:
#by default include------summary batata hai.
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [25]:
df.describe(datetime_is_numeric=False)

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

- Data ki summary nikalne ke liye **2nd method**
- **2. groupby method**
    - statistic ke result ka further catogrize krne ke liye

In [27]:
df.total_bill.sum()

4827.77

In [31]:
df.groupby(by="day")[["total_bill"]].sum()      #return a dataframe

      total_bill
day
Fri       325.88
Sat      1778.40
Sun      1627.16
Thur     1096.33

In [32]:
df.groupby(by="gender")[["total_bill"]].sum()

        total_bill
gender
Female     1570.95
Male       3256.82

In [35]:
df.groupby(by="gender")[["smoker"]].max()

       smoker
gender
Female    Yes
Male      Yes

In [37]:
#further catogrize-----nested further
df.groupby(by=["day","time"])[["total_bill"]].sum()   #return a dataframe

             total_bill
day  time
Fri  Dinner      235.96
     Lunch        89.92
Sat  Dinner     1778.40
Sun  Dinner     1627.16
Thur Dinner       18.78
     Lunch      1077.55

- Data ki summary nikalne ke liye **3rd method**
- **3. pivot_table method**

In [36]:
df.pivot_table(index='day',values='total_bill',aggfunc='sum')   #return a dataframe

      total_bill
day
Fri       325.88
Sat      1778.40
Sun      1627.16
Thur     1096.33

In [39]:
df.pivot_table(index=["day","time"],values="total_bill",aggfunc="sum")    #return a dataframe

             total_bill
day  time
Fri  Dinner      235.96
     Lunch        89.92
Sat  Dinner     1778.40
Sun  Dinner     1627.16
Thur Dinner       18.78
     Lunch      1077.55

In [41]:
#ye wala sirf pivot se hi hoga ---------groupby se nhi hoga---------layout ko badalna
df.pivot_table(index=["day"],values="total_bill",aggfunc="sum",columns="time")    #return a dataframe

time   Dinner    Lunch
day
Fri    235.96    89.92
Sat   1778.40      NaN
Sun   1627.16      NaN
Thur    18.78  1077.55

In [43]:
#is result ko result dataframe me save kr ke
resdf=df.pivot_table(index=["day"],values="total_bill",aggfunc=["sum",'mean','count'],columns="time")    #return a dataframe

In [44]:
resdf

          sum                mean             count
time   Dinner    Lunch     Dinner      Lunch Dinner Lunch
day
Fri    235.96    89.92  19.663333  12.845714   12.0   7.0
Sat   1778.40      NaN  20.441379        NaN   87.0   NaN
Sun   1627.16      NaN  21.410000        NaN   76.0   NaN
Thur    18.78  1077.55  18.780000  17.664754    1.0  61.0

In [45]:
#is dataframe ko humne to_excel me store kr diya.
resdf.to_excel("E:/New folder (2)/20. Statistics & Analytics/3. Pandas/result_dataframe.xlsx")         #index=False is bari nhi krege kyoki index is bari time hai.